"ch13ex00k1" = "// Thêm bất kỳ hàng nào bị thiếu vào dãy của bạn.";

"ch13ex00k2" = "// Đặt một nhân vật trên từng hàng trong các hàng.";

"ch13ex01k1" = "// Đặt tên cho biến vòng lặp và chuyển vào dãy của bạn.";

"ch13ex01k2" = "    // Đặt một viên ngọc và một công tắc cho từng cột.";

"ch13ex02k1" = "// Thêm hai tọa độ góc còn lại.";

"ch13ex02k2" = "// Đặt năm khối tại mỗi tọa độ.";

"ch13ex03k1" = "// Loại bỏ cổng.";

"ch13ex03k2" = "// Loại bỏ viên ngọc.";

"ch13ex03k3" = "// Chèn chuyên gia.";

"ch13ex04k1" = "    // Kiểm tra các tọa độ với một cột > 5 HOẶC một hàng < 4.";

"ch13ex04k2" = "        // Nối tọa độ vào blockSet.";

"ch13ex04k3" = "// Đối với mỗi tọa độ trong blockSet, hãy đặt sáu khối.";

"ch13ex05k1" = "// Tạo ra hai dãy trống của kiểu [Tọa độ].";

"ch13ex05k2" = "        // Nối vào dãy đảo.";

"ch13ex05k3" = "        // Nối vào dãy biển.";

"ch13ex05k4" = "// Đối với dãy đảo của bạn, hãy đặt các khối.";

"ch13ex05k5" = "// Đối với dãy biển của bạn, hãy đặt nước.";

"ch13ex06k1" = "// Tạo một dãy gồm tất cả các tọa độ trong hàng 2.";

"ch13ex06k2" = "// Tạo một dãy trống gồm các tọa độ.";

"ch13ex06k3" = "    // Xóa một tọa độ và nối vào dãy trống của bạn.";

"ch13ex06k4" = "// Đặt một nhân vật cho từng tọa độ được thêm vào dãy trống của bạn.";

"ch13ex07k1" = "// Lưu ý số lượng thể hiện của Blu trong dãy của bạn.";

"ch13ex07k2" = "// Đặt Blu tại từng cột trong hàng 4.";

"ch13ex07k3" = "// Tìm lỗi chỉ mục ngoài phạm vi.";

"ch13ex08k1" = "        // Đặt một khối.";

"ch13ex08k2" = "    // Tăng dần chỉ mục.";

"ch13ex09k1" = "// Nối các số ngẫu nhiên vào chiều cao.";

"ch13ex09k2" = "    // currentHeight lưu trữ chiều cao tại chỉ mục hiện tại.";

"ch13ex09k3" = "        // Làm điều gì đó thú vị nếu currentHeight bằng 0.";

"ch13ex09k4" = "            // Làm điều gì đó khác biệt, ví dụ như đặt một nhân vật.";

"ch13ex09k5" = "            // Làm điều gì đó khác biệt, ví dụ như đặt nước.";

"ch13ex09k6" = "        // Thêm các quy tắc khác để tùy chỉnh thế giới của bạn.";

"ch13ex10k1" = "    // Thay đổi chiều cao thành tổng của cột và hàng cho từng tọa độ.";

"ch13ex10k2" = "// Khởi tạo một dãy các nhân vật hiện có trong thế giới câu đố.";

"ch13ex10k3" = "// Đối với mỗi nhân vật, hãy thực hiện một nhóm tác vụ.";

"ch13ex11k1" = "// Tạo ra các vùng tọa độ.";

"ch13ex11k2" = "// Đặt các khóa bậc.";

"ch13ex11k3" = "// Đặt các nhân vật và bậc.";

"ch13ex11k4" = "// Tạo ra các dãy từ các nhân vật hiện có.";

"ch13ex11k5" = "// Làm những việc tuyệt vời 🤓.";
